[
  {
    "slug": "fellowship-vertical-horizontal-spirit",
    "title": "Fellowship: Vertical and Horizontal in the Spirit",
    "description": "Exploring 1 John 1:6-7 and what it means for fellowship to truly be of the Spirit",
    "publishedAt": "2026-02-14",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Bible"
        ]
      }
    ],
    "content": "\n# Fellowship: Vertical and Horizontal in the Spirit\n\nIn 1 John 1:6–7, we encounter a passage that most Christians can immediately affirm:\n\n> \"If we say that we have fellowship with Him and yet walk in the darkness, we lie and are not practicing the truth; but if we walk in the light as He is in the light, we have fellowship with one another, and the blood of Jesus His Son cleanses us from every sin.\"\n\nNotice how fellowship is mentioned twice here: **fellowship with Him** and **fellowship with one another**. \n\nThis gives us a two-dimensional picture of fellowship—what we might call **vertical** (with God) and **horizontal** (with other believers). No controversy here. Most Christians would nod along: yes, we need fellowship with God *and* fellowship with the body of Christ.\n\nBut here's where it gets interesting: **What exactly *is* fellowship in this context?**\n\n---\n\n## What Is Fellowship?\n\nThe word \"fellowship\" suggests joint participation—something shared together. In Greek, the word is *koinonia*, which carries the idea of communion, partnership, or sharing in common.\n\nBut to truly understand what fellowship means, we need to look at another key verse: **2 Corinthians 13:14**.\n\n> \"The grace of the Lord Jesus Christ and the love of God and the fellowship of the Holy Spirit be with all of you.\"\n\nHere's a pattern we should notice:\n- **Christ** is grace\n- **God (the Father)** is love  \n- **The Holy Spirit** is... fellowship\n\nNow, we readily accept that Christ embodies grace. We have no problem saying \"God is love\" (see 1 John 4:8). But can we also accept that **the Spirit *is* fellowship**?\n\nIf we can, then we unlock something crucial: **Fellowship—both with God and with one another—is entirely a matter of the Spirit.**\n\n---\n\n## Fellowship with God: Obviously the Spirit\n\nWhen it comes to our relationship with God, this is fairly obvious. We don't fellowship with God in the natural realm—we don't see Him, touch Him, or hear His audible voice most of the time. Our fellowship with God happens in the spirit. **John 4:24** confirms this:\n\n> \"God is Spirit, and those who worship Him must worship in spirit and truthfulness.\"\n\nSo when we pray, when we worship, when we sense God's presence or respond to His leading—that's the Holy Spirit mediating our fellowship with the Father and the Son.\n\nNo debate there.\n\n---\n\n## Fellowship with One Another: Where It Gets Practical\n\nBut what about our contact with **one another**?\n\nThis is where the rubber meets the road. Is every gathering of Christians automatically \"fellowship\"? If a group of believers meets to carry out a spiritual activity—Bible study, worship, outreach—does that qualify as fellowship?\n\n**Well, that depends.**\n\nHere's the real question: **Are we contacting one another through the Spirit?**\n\nJust as fellowship with God requires being in the Spirit, so does fellowship with one another. You can be surrounded by Christians, sing songs together, even discuss Scripture, and yet not truly be in fellowship if the **Spirit isn't the medium** through which you're connecting.\n\nThink about it practically:\n- You can have a church service where everyone is physically present, but spiritually isolated.\n- You can have a \"fellowship meal\" where no one is actually sharing anything of Christ with one another.\n- You can even have a prayer meeting where people are saying words *at* each other instead of ministering Christ *to* one another.\n\nTrue fellowship isn't primarily about being together in a room or engaging in religious activities. It's about **sharing Christ through the Spirit**. It's about the flow of the Spirit between believers as they give and receive from the supply of the Spirit in one another.\n\n---\n\n## The Test: Are We in the Spirit?\n\nSo here's the challenge: in our gatherings, in our conversations, in our interactions with other believers—**are we in the Spirit?**\n\n- When we talk, are we ministering Christ or just exchanging opinions?\n- When we pray together, are we touching the throne of grace or performing a ritual?\n- When we \"do life\" together, are we bearing witness to the Spirit's reality or simply being social?\n\nThe vertical and horizontal dimensions of fellowship are inseparable because they share the same source: **the Holy Spirit**. Our fellowship with God is limited if we refuse to fellowship with His people. And our fellowship with one another is hindered unless we're both touching the same Spirit.\n\n---\n\n## Conclusion\n\nFellowship is of the Spirit. That means:\n- It's not automatic just because Christians are in the same room.\n- It's not a program or an event on the calendar.\n- It requires that we live, move, and relate **in the Spirit**.\n\nSo the next time you gather with believers, ask yourself: *Am I here in the Spirit? Am I giving and receiving Christ? Is the Spirit flowing between us?*\n\nThat's what makes fellowship real—vertical and horizontal, all by the one Spirit.\n"
  },
  {
    "slug": "nestjs-dotnet-discipline-nodejs",
    "title": "NestJS: Bringing .NET Discipline to Node.js Development",
    "description": "Why I chose NestJS over raw Node.js - comparing runtimes, frameworks, and the case for structured development",
    "publishedAt": "2025-12-28",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Software Engineering"
        ]
      }
    ],
    "content": "\n# NestJS: Bringing .NET Discipline to Node.js Development\n\nNode.js gives you freedom. Too much freedom.\n\nWhen faced with choosing between Node and .NET runtimes, I found myself torn. My instincts pulled me toward .NET's baked-in structure—dependency injection, interfaces, static typing. But reality kept pushing me toward Node: more developers, more ecosystem, more opportunities.\n\nThen I discovered NestJS. It wasn't just another Node framework—it was the bridge that let me write Node code with .NET discipline. Here's why that matters, what I learned, and whether the tradeoffs are worth it.\n\n---\n\n## 🤔 The Runtime Dilemma: Node vs .NET\n\nLet's be honest about the choice:\n\n**Node.js advantages:**\n- Massive ecosystem and community\n- Single language for frontend/backend (JavaScript/TypeScript)\n- Excellent for I/O-bound workloads\n- Lower resource consumption\n\n**.NET advantages:**\n- Strong typing and compile-time safety\n- Rich framework ecosystem (ASP.NET, EF Core, etc.)\n- Built-in patterns (DI, interfaces, middleware)\n- Excellent tooling and debugging\n\nBut here's the kicker: **more people know Node**. In a world where hiring and team composition matter, that Node ubiquity carries real weight.\n\n---\n\n## 😟 My Hesitation with Raw Node.js\n\nI love the idea of Node. JavaScript everywhere? Sign me up. But raw Node development made me uncomfortable:\n\n### The Import Chaos\n```javascript\n// In any file, anywhere\nconst express = require('express');\nconst db = require('../database/connection');\nconst auth = require('./middleware/auth');\nconst logger = require('../../utils/logger');\nconst config = require('../../../config');\n```\n\nAnything can import anything. Dependencies become a tangled web. Where does this function live? Who owns this module? What happens if I break this import chain?\n\n### Testing Nightmares\nUnit testing becomes guesswork. Without clear boundaries, mocking dependencies turns into an archaeological dig through your codebase. Is this function pure? Does it have side effects? Good luck figuring that out.\n\n### The Structure Vacuum\nNode gives you freedom, but freedom without guardrails leads to the wild west. Every team reinvents architecture, patterns, and conventions. Consistency? That's someone else's problem.\n\n---\n\n## 🔍 Discovering NestJS: Node with .NET Structure\n\nNestJS changed everything. It wasn't just \"another framework\"—it was Node.js with .NET's discipline baked in.\n\nNestJS brings familiar .NET patterns to the JavaScript world:\n\n### Modules for Dependency Injection\nInstead of chaotic imports, NestJS gives you proper DI:\n\n```typescript\n// user.module.ts\n@Module({\n  imports: [DatabaseModule, AuthModule],\n  controllers: [UserController],\n  providers: [UserService, UserRepository],\n  exports: [UserService]\n})\nexport class UserModule {}\n```\n\nThis is your `Program.cs` in TypeScript. Clear boundaries, explicit dependencies, testable modules.\n\n### CQRS Module (Like MediatR)\nNestJS has a CQRS module that feels like MediatR for .NET:\n\n```typescript\n// commands/create-user.command.ts\nexport class CreateUserCommand {\n  constructor(\n    public readonly email: string,\n    public readonly name: string\n  ) {}\n}\n\n// handlers/create-user.handler.ts\n@Injectable()\nexport class CreateUserHandler implements ICommandHandler<CreateUserCommand> {\n  async execute(command: CreateUserCommand): Promise<User> {\n    // Business logic here\n  }\n}\n```\n\nCommands, queries, handlers—all properly separated and testable.\n\n### Prisma Module (Like EF Core)\nNestJS integrates beautifully with Prisma:\n\n```typescript\n@Injectable()\nexport class UserRepository {\n  constructor(private prisma: PrismaService) {}\n\n  async findById(id: string): Promise<User> {\n    return this.prisma.user.findUnique({ where: { id } });\n  }\n}\n```\n\nType-safe database operations with proper abstraction layers.\n\n### BullMQ Module (Like Hangfire)\nBackground jobs become structured and observable:\n\n```typescript\n@Injectable()\nexport class EmailService {\n  constructor(private readonly emailQueue: BullQueue) {}\n\n  async sendWelcomeEmail(userId: string) {\n    await this.emailQueue.add('send-welcome', { userId });\n  }\n}\n```\n\nQueues, workers, retries—all properly managed.\n\n---\n\n## 🤔 Is NestJS Worth It? The Critical Question\n\nHere's where it gets interesting. NestJS is a framework on top of Node.js. It adds abstraction, convention, and structure. But is that abstraction worth it?\n\n### The Framework Tax\nNestJS isn't \"raw Node.\" You pay a learning curve. You adopt its conventions. You work within its patterns. More people know Node than NestJS.\n\nBut here's my counterargument: **We already advocate for TypeScript over JavaScript.**\n\nTypeScript isn't \"raw JS.\" It adds discipline, restriction, and structure. We accept this because the benefits outweigh the costs. Frameworks should be judged the same way.\n\n### The Discipline Argument\nFrameworks aren't about making things easier. They're about making things *possible*. They provide:\n\n- **Consistent patterns** across teams and projects\n- **Guardrails** that prevent common mistakes\n- **Abstractions** that hide complexity but expose power\n- **Boundaries** that make testing and maintenance tractable\n\n### The AI Advantage\nThis becomes even more critical with AI-assisted development. When you work in a framework:\n\n- AI understands the patterns and conventions\n- Code generation stays within architectural boundaries\n- Refactoring respects module and dependency rules\n- AI suggestions align with your system's design\n\nRaw Node? AI might generate beautiful code, but it could be architecturally incoherent. NestJS keeps AI disciplined.\n\n---\n\n## 🧠 What I Learned\n\n1. **Runtime choice is about tradeoffs, not superiority.**\n   - .NET gives you structure out of the box\n   - Node gives you ubiquity and flexibility\n\n2. **Frameworks are investments in discipline.**\n   - They cost upfront learning\n   - They pay dividends in consistency and maintainability\n\n3. **Structure enables scale.**\n   - Raw Node scales to chaos\n   - Structured Node (via NestJS) scales to teams and complexity\n\n4. **AI needs guardrails too.**\n   - Frameworks constrain AI within architectural boundaries\n   - This leads to more coherent, maintainable generated code\n\n---\n\n## 🔚 Final Thoughts\n\nNestJS let me have my cake and eat it too—Node's ecosystem with .NET's discipline. It wasn't about rejecting Node; it was about embracing structure.\n\nIf you're hesitating between raw Node and something more structured, ask yourself: Do you want freedom, or do you want guardrails that lead to better outcomes?\n\nSometimes, I want guardrails instead of freedom.\n\n"
  },
  {
    "slug": "eph3-building",
    "title": "Two Buildings & Two Groups of Builders",
    "description": "The personal and corporate building work of Christ in Ephesians 3 and 4",
    "publishedAt": "2025-11-18",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Bible"
        ]
      }
    ],
    "content": "\n# Two Buildings & Two Groups of Builders\n\nIn Ephesians 3 and 4, Paul presents us with a vision of Christian life that is both deeply personal and profoundly corporate. He shows us two complementary \"buildings\" — one that happens inwardly, and one that happens outwardly. Together, they describe the full Christian experience.\n\nBut buildings don't build themselves. Paul also shows us two groups of \"builders\" — those who lay foundations through revelation, and those who build together through grace.\n\nThis isn't just theology. This is how Christ works in us and among us.\n\n---\n\n## I. Two Buildings\n\nPaul presents two complementary \"buildings\" in Ephesians — one inward (a building \"down\") and one outward (a \"building up\"). Together they describe the full Christian experience.\n\n### 1. Christ Making His Home in the Heart (Eph. 3:17–19)\n\nThis is the personal building — what Christ builds in you.\n\n> \"That Christ may make His home (*kataoikeo*) in your hearts through faith…\"\n\nThis building includes:\n\n- **Inward formation** — Christ settling into every \"room\" of our inner being\n- **Rooted and grounded in love** — stability and nourishment\n- **Experiential knowing** — \"to know the love of Christ which surpasses knowledge\"\n- **Inner fullness** — \"filled unto all the fullness of God\"\n\nThis is spiritual construction happening privately, personally, and inwardly.\n\nBefore the church can be built outwardly, Christ must build Himself inwardly.\n\nThis is the first building — the home Christ makes in the believer.\n\n---\n\n### 2. The Building Up of the Body of Christ (Eph. 4:12–16)\n\nThis is the corporate building — what Christ builds among us.\n\n> \"...for the building up of the Body of Christ… until we all arrive at the fullness of Christ.\"\n\nThis building includes:\n\n- **Unity of the faith**\n- **Corporate knowledge of Christ**\n- **A full-grown Body**\n- **Every joint supplying**\n- **The Body building itself up in love**\n\nThis is Christ expressed in community, fellowship, and mutual care.\n\nThis is the second building — the church built up in love.\n\n---\n\n## II. Two Builders\n\nHow do these two buildings actually take place?\n\nPaul presents two groups of \"builders\" — both necessary, both intentional.\n\n### 1. The Gifted Ones — Apostles and Prophets (Eph. 3:5; 4:11)\n\nThese are the foundational givers and initiators of revelation.\n\n- In chapter 3 they receive the mystery of Christ first (\"revealed to His holy apostles and prophets\").\n- In chapter 4 they are given as gifts to the church (\"He gave some as apostles, some as prophets…\").\n\nTheir function:\n\n- **Open the revelation of Christ**\n- **Lay spiritual foundations**\n- **Equip others with what they see**\n\nThey are not an elite class; Paul calls himself:\n\n> \"Less than the least of all saints.\" (3:8)\n\nTheir role is foundational, not superior.\n\nThese are the first builders — those who equip by revelation.\n\n---\n\n### 2. The Perfected Ones — All the Saints (Eph. 4:7, 12, 16)\n\nEvery believer is a builder. Every believer receives:\n\n> \"...grace… to each one according to the measure of Christ.\" (4:7)\n\nThe gifted ones equip the saints so that the saints:\n\n- **minister**\n- **supply**\n- **grow**\n- **function**\n- **build up the Body**\n\nThe building of the church is not done *for* the saints but *by* the saints.\n\nPaul's vision is a church where:\n\n- **every believer supplies a portion**\n- **every believer contributes to growth**\n- **every believer is essential**\n- **every believer participates in Christ's expression**\n- **the Body builds itself up in love**\n\nThese are the second builders — the perfected saints.\n\n---\n\n## III. The Flow of Building\n\nHere's how it all works together:\n\n**Christ builds Himself into us** (ch. 3).  \n**Christ builds us into His Body** (ch. 4).\n\n**Apostles/prophets lay the foundation** by revelation.  \n**Saints grow, function, and build together** by grace.\n\nThis is not a hierarchy. It's a flow. The gifted ones receive and give. The perfected ones receive and build. Both are essential. Both are needed.\n\n---\n\n## Why This Matters\n\nThis vision matters because it shows us:\n\n1. **The personal foundation must come first.** Before we can build together, Christ must build in us. Before we can supply others, we must be supplied by Christ.\n\n2. **Every believer is essential.** The building of the church is not the work of a few gifted leaders. It's the work of every saint, each contributing their portion of Christ.\n\n3. **The goal is corporate expression.** Christ's purpose is not just individual transformation, but a Body that expresses Him fully — a church built up in love until we all arrive at the fullness of Christ.\n\n4. **Both builders are needed.** We need those who receive revelation and lay foundations. We also need every saint functioning, supplying, and building. One without the other is incomplete.\n\n---\n\n## Final Word\n\nTwo buildings. Two builders. One Christ.\n\nThe building work of Christ is both personal and corporate. It requires both those who equip by revelation and those who build by grace.\n\nLet us therefore allow Christ to make His home in our hearts — that we might be rooted and grounded in love, filled with all the fullness of God.\n\nAnd let us build together — each one supplying, each one functioning, each one essential — until we all arrive at the fullness of Christ.\n\nThis is the church God is building.  \nThis is the building work we are called to.\n\n"
  },
  {
    "slug": "eph4-giving",
    "title": "Understanding Ephesians 4:7–12: Grace, Gifts, and the Building of the Church",
    "description": "A closer look at how Paul uses grammar and literary structure to reveal Christ's giving of grace and gifts",
    "publishedAt": "2025-11-17",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Bible"
        ]
      }
    ],
    "content": "\n# Understanding Ephesians 4:7–12: Grace, Gifts, and the Building of the Church\n\nEphesians 4:7–12 is one of those passages that feels simple at first glance but rewards a closer read. It's about grace, giving, and the way Christ equips His people, and a careful look at the grammar and literary structure reveals just how brilliantly Paul makes his case.\n\n---\n\n## 1. The Backbone of the Passage: Giving\n\nThe key to this passage is the verb \"give.\" Paul begins with a bold statement in verse 7:\n\n> \"But to each one of us grace was given according to the measure of the gift of Christ.\"\n\nHere, the emphasis is on grace distributed to each believer, not abstractly, but in measured portions. This grace is personal and functional—it equips every Christian for participation in the life and work of the church.\n\nThen in verse 8, Paul quotes Psalm 68:\n\n> \"Having ascended to the height, He led captive those taken captive and gave gifts to men.\"\n\nNotice what Paul highlights: the Psalm talks about someone ascending and giving gifts. The verb \"gave\" is what Paul latches onto—not the ascension itself. The act of giving is the proof that Christ is the one who equips the church. The ascension becomes a parenthetical aside, explained in verses 9–10:\n\n> \"Now this, 'He ascended,' what is it except that He also descended into the lower parts of the earth? He who descended, He is also the One who ascended far above all the heavens that He might fill all things.\"\n\nThis is not a theological detour. Grammatically, it's a necessary clarification: the Psalm says \"ascended,\" and Paul needs to show that Christ—who also descended—is the legitimate, authoritative giver.\n\n---\n\n## 2. The Gifts Are People, Not Just Abilities\n\nVerse 11 continues the thread:\n\n> \"And He Himself gave some as apostles, some as prophets, some as evangelists, some as shepherds and teachers…\"\n\nNotice something important: the gifts are people, not abstract spiritual abilities. These gifted individuals are given to the church, not to each believer personally. They serve a corporate function, equipping the body for ministry.\n\nVerse 12 then makes the purpose crystal clear:\n\n> \"To prepare God's people for works of service, so that the body of Christ may be built up.\"\n\nHere is the connection: the grace each believer receives (v. 7) is perfected, matured, and brought into action through the gifted people Christ gives. The apostles, prophets, evangelists, shepherds, and teachers are conduits of grace—they help each believer discover and exercise their portion of Christ's gift.\n\n---\n\n## 3. Psalm 68 and Paul's Adaptation\n\nA curious point: Psalm 68 in Hebrew says \"received gifts,\" not \"gave gifts.\" Why does Paul flip it?\n\nThis is a literary move, not a mistake. In the ancient Near Eastern context, a victorious king receives tribute so that he can distribute it. Jewish interpretive tradition often read Psalm 68 this way, emphasizing the giving that naturally follows receiving. Paul, then, is highlighting the distribution aspect: Christ doesn't just receive power or victory; He gives it generously to His people.\n\n---\n\n## 4. Pulling It Together: What Is Actually Given?\n\nPaul's logic flows like this:\n\n1. Grace is given to each believer in measured portions (v. 7).\n2. Gifted individuals are given to the church (v. 11).\n3. The purpose is building up the body (v. 12).\n\nIn other words, what Christ gives is both:\n\n- **Internal grace**, enabling each believer to serve, and\n- **External gifts**, people who guide, equip, and strengthen the community.\n\nEven Paul's own example—he calls himself \"less than the least of all the saints\"—illustrates this principle. Grace is measured, but Christ gives it faithfully so that every believer, even the humblest, can participate in the ministry of building the church.\n\n---\n\n## 5. The Takeaway\n\nEphesians 4:7–12 shows the elegance of Paul's thought:\n\n- **Giving is central.** Grace comes first, then people who equip.\n- **Ascension is the authority behind giving.** Christ's descent and ascent legitimize and empower the gifts.\n- **Purpose matters.** Grace and gifted people are meant to prepare the saints and build up the body.\n\nFor modern readers, this passage is both reassuring and practical: every believer receives a portion of Christ's grace, and the church receives gifted leaders to help that grace flourish. Grace is given, gifts are given, and together they build the body of Christ.\n\n"
  },
  {
    "slug": "ai-technical-debt-mortgage",
    "title": "AI in Software Engineering: The Technical Debt Mortgage",
    "description": "When AI becomes your strategic bridge to better engineering",
    "publishedAt": "2025-08-22",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Software Engineering",
          "AI"
        ]
      }
    ],
    "content": "\n# AI in Software Engineering: The Technical Debt Mortgage\n\nThe AI debate in software engineering has become increasingly polarized. On one side, we hear dramatic predictions about AI replacing developers entirely. On the other, there's fierce resistance, with critics dismissing AI as nothing more than a technical debt generator. After recent hands-on experience, I've come to see it differently: AI is like a mortgage in your technical toolkit – it has its place when used strategically.\n\n## The Mess We Inherit\n\nRecently, I inherited a codebase that probably looks familiar to many of you. You know the type – the kind that makes you want to reach for a strong coffee and a long weekend. It had all the hallmarks of code written without long-term maintenance in mind: cron jobs that failed silently, processes that died without warning, and zero visibility into what was actually happening. The kind of system that keeps you up at night wondering if everything will still be running in the morning.\n\nWhen something failed, it was nearly impossible to tell what went wrong or if it had failed at all. The system had been running on hope and prayer for months, with no monitoring, no alerting, and no way to trace failures back to their root causes. It was a perfect storm of technical debt that had accumulated over years of \"quick fixes\" and \"temporary solutions.\"\n\n## The Business Reality\n\nEveryone says \"just rebuild it from scratch\" – but try telling that to the business when critical systems are down and customers are waiting. You can't just hit pause on revenue while you craft the perfect solution. This is where the mortgage analogy becomes particularly relevant.\n\nIn many organizations, especially those with legacy systems, there's a constant tension between the need for immediate functionality and the desire for long-term architectural excellence. The business needs the system to work today, not in six months when you've finished a complete rewrite.\n\n## Strategic Borrowing with AI\n\nSo I did what any desperate engineer does: I borrowed time. But this time, I borrowed it from AI. In a few frantic hours, it spit out monitoring dashboards and some tactical refactoring. Not perfect, but enough to give us breathing room. Enough to see what was actually breaking and why.\n\nThe AI-generated solution included:\n- A basic monitoring dashboard that tracked key system metrics\n- Simpler retry mechanisms for failed processes\n- Basic logging improvements that made debugging possible\n\nWas it the perfect, final solution? No. But like a well-planned mortgage, it was low-interest technical debt that bought us the space we needed to do things right.\n\n## The Mortgage Metaphor\n\nIt's like taking out a mortgage when you need a house now, not in 20 years. The debt isn't the problem – it's the unplanned, high-interest kind that kills you. Used strategically, with the right tools (including AI), it can buy you the space you need to do things right.\n\nJust as a mortgage helps you acquire a house when you don't have the full cash amount, strategic technical debt can help you bridge the gap between immediate needs and long-term solutions. The key is being intentional about it.\n\n## The Strategic Compromise\n\nHere's why this approach worked:\n- The AI-assisted solution was internal-facing – no customer-facing code was compromised\n- It provided immediate visibility into our system's problems\n- Most importantly, it bought us the time needed to properly engineer a robust solution\n- The \"debt\" was structured and manageable, not the chaotic accumulation of quick fixes\n\n## Engineering Wisdom: Know When to Borrow\n\nThe system is still a mess, but now it's a mess we can see and control. And that's the first step toward something better.\n\nThe real engineering wisdom isn't in always building everything from scratch or in completely avoiding technical debt. It's in knowing when and how to strategically use the tools at your disposal – including AI.\n\nWe're still working on that comprehensive reengineering project, but now we're doing it with better monitoring, clearer insights, and without the pressure of flying blind. We've left the quick patches to AI while focusing our engineering expertise on building the sustainable, long-term solution.\n\n## The Tool, Not the Replacement\n\nThe way I see it, AI is just another engineering tool. This one happens to be very good at lending time when you need it most.\n\nIn the end, AI isn't replacing software engineers – it's becoming another tool in our belt. Like a mortgage, it's neither inherently good nor bad. It's all about how you use it. And sometimes, the smartest move isn't to build everything from scratch, but to know when to borrow strategically.\n\nBorrow responsibly.\n"
  },
  {
    "slug": "scaling-out",
    "title": "Scaling Out",
    "description": "Concepts on scaling out",
    "publishedAt": "2025-07-26",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Software Engineering"
        ]
      }
    ],
    "content": "\n# Scaling Out\n\nIf you’ve ever had a web app get slower as traffic increases, you’ve already brushed up against a core problem in software engineering: how do we scale?\n\nThere are two major ways to scale a system:  \n**Scaling up** (vertical scaling) and **scaling out** (horizontal scaling). \n\nLet’s break those down real quick.\n\n- **Scaling up** means upgrading your server. Add more CPU. Add more memory. You’re trying to beef up a single machine to handle more load.\n- **Scaling out** means adding more machines (or containers, or processes). Instead of making one server stronger, you create more instances of the same server and distribute the load.\n\nScaling up is simple but limited—you’ll eventually max out what one machine can do. Scaling out is more flexible and resilient, but it comes with design trade-offs you have to plan for. And that’s what this article is about.\n\n## How Scaling Out Works in the Cloud\n\nIn a cloud environment like Azure, AWS, or Google Cloud, scaling out typically involves creating **multiple instances** of your app. These could be containers in Kubernetes, App Service instances, or EC2 machines.\n\nBut here’s the key piece: you’re not routing traffic to these instances yourself.\n\nInstead, a **load balancer** sits in front of them. The load balancer receives incoming traffic and distributes it across the available instances. It might do this based on round-robin, least connections, or even geographic proximity—but those details are out of scope for now.\n\nThe important thing is this:  \n> When you scale out, **your users aren't guaranteed to hit the same server twice**.\n\nThat sounds obvious, but it changes everything. If your app stores anything locally—files, memory, scheduled tasks—you need to rethink how those things work across multiple instances.\n\nLet’s look at a few concrete examples.\n\n## A Basic Example: File Storage\n\nImagine you have a simple app that lets users upload profile pictures. Nothing fancy. Maybe it's running on a single server, and every file upload just gets saved to a local folder on disk:\n\n```\n/uploads/user-123/avatar.jpg\n```\n\nThis works great—until it doesn't.\n\nLet’s say your app starts to grow. You add more servers behind a load balancer to keep up with demand. Now, a user might upload their image on **Server A**, but then refresh the page and get routed to **Server B**. Uh-oh—Server B doesn’t have that file, because it was saved locally on Server A.\n\n### The Fix: Shared Remote Storage\n\nThis is where **shared file storage** comes in. Instead of writing files to the local disk, write them to a centralized location like AWS S3, Azure Blob Storage, or a shared NFS. Now it doesn’t matter which server handles the request—everyone can access the same file store.\n\n### Why This Matters\n\nThis design change might feel small, but it’s the foundation of building systems that can scale out cleanly. You have to **design for multiple instances** from the start. Otherwise, your app will break the moment you move beyond a single machine.\n\nNow, let’s look at an example that’s a bit more sneaky.\n\n## A Subtle Example: In-Memory Cron Jobs\n\nLet’s say you have a background job that runs every hour to clean up expired records. Seems harmless enough. In Node, you might use something like `node-cron`, or in .NET maybe just a `Timer` or a hosted background service.\n\nIt looks something like this:\n\n**Node.js (using `node-cron`)**\n```javascript\nconst cron = require('node-cron');\n\ncron.schedule('0 * * * *', () => {\n  deleteExpiredRecords();\n});\n```\n\n**.NET (using `IHostedService`)**\n```csharp\npublic class CleanupService : IHostedService\n{\n    public Task StartAsync(CancellationToken cancellationToken)\n    {\n        _timer = new Timer(DeleteExpiredRecords, null, TimeSpan.Zero, TimeSpan.FromHours(1));\n        return Task.CompletedTask;\n    }\n\n    private void DeleteExpiredRecords(object? state)\n    {\n        // Cleanup logic here\n    }\n}\n```\n\nThis works perfectly… until you scale out.\n\n### What Happens When You Scale Out?\n\nNow that you’ve added multiple instances of your app, **every instance runs the same job** at the same time. If you have five servers, that job runs five times. That might be okay—or it might cause race conditions, database contention, or just unnecessary work.\n\nThis one bit me early in my career. I was working on a customer notifications system, and the reminder emails started going out five times an hour. One for each app server. The fix? A better design for distributed jobs.\n\n### The Fix: Centralized Job Scheduling\n\nInstead of running cron jobs in memory, you can move job scheduling and execution to a **centralized queue**—something like Redis, SQL Server, or a dedicated message broker. The idea is simple: only one worker (or one instance at a time) should run the job.\n\nLet’s see how this looks in practice.\n\n#### Node.js with BullMQ (Redis-backed)\n```javascript\nimport { Queue, Worker } from 'bullmq';\n\nconst queue = new Queue('cleanup-jobs', { connection: { host: 'localhost', port: 6379 } });\n\n// Schedule a job once per hour\nawait queue.add('delete-expired', {}, { repeat: { cron: '0 * * * *' } });\n\n// A worker picks it up – only one runs the job\nconst worker = new Worker('cleanup-jobs', async job => {\n  if (job.name === 'delete-expired') {\n    await deleteExpiredRecords();\n  }\n});\n```\n\n#### .NET with Hangfire (SQL-backed)\n```csharp\nRecurringJob.AddOrUpdate(\n    \"delete-expired-records\",\n    () => DeleteExpiredRecords(),\n    Cron.Hourly\n);\n```\n\nBoth BullMQ and Hangfire take care of **distributed locking**. You can have many app instances running, but only one will pick up and run the job.\n\n## Final Thoughts\n\nScaling out is powerful, but only if your application is **designed** for it. That’s the key takeaway. Problems like shared file systems or duplicate cron jobs aren’t bugs—they’re symptoms of a design that assumes one instance.\n\nAnd scaling out breaks that assumption.\n\nSo if you’re starting a new app—or refactoring an old one—take a moment to ask:  \n> What happens when I run two of these at once?\n\nDesign for that. Test for that.  \nBecause if your app is successful, it’s not a question of *if* you’ll need to scale. It’s just a question of *when*."
  },
  {
    "slug": "one-new-man",
    "title": "The One New Man",
    "description": "The One New Man in Colossians 3",
    "publishedAt": "2025-07-06",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Bible"
        ]
      }
    ],
    "content": "\n# The One New Man: God's New Humanity in Christ\n\n> “...You have put on the new man, who is being renewed unto full knowledge according to the image of Him who created him... where there cannot be Greek and Jew... but Christ is all and in all.”  \n> — *Colossians 3:10–11*\n\nWhen Paul says “new man” in Colossians, many English translations render it “new self.” But in Greek, the word isn’t *autos* (self) — it’s **anthrōpos** — *man* or *humanity*.\n\nPaul isn’t just speaking of inward renewal — he’s speaking of a new, shared identity.  \nHe’s pointing to a **corporate person**, a **new humanity** created by God in Christ.\n\n---\n\n## Where Was the New Man Created?\n\nPaul tells us in **Ephesians 2:15**:  \n> “...that He might create the two in Himself into one new man...”\n\nThis new man was not formed over time — he was **created**.  \nCreated **on the cross**, when Christ:\n- Ended the **old creation**\n- Abolished the **ordinances** that divided humanity\n- Crucified the **flesh** (Romans 6:6)\n- Condemned the **world** (Galatians 6:14)\n\nIn His death, Christ didn’t just remove sin — He cleared the ground for something new.\n\nAnd in His resurrection, He became the Head of a **new race**, the **Second Man** (1 Corinthians 15:47), the beginning of a **new creation**.\n\n---\n\n## God's Original Purpose: A Corporate Man\n\nIn **Genesis 1:26**, God said:  \n> “Let Us make man in Our image... and let them have dominion.”\n\nEven though “man” is singular, the next phrase — “let *them* have dominion” — reveals a **corporate intention**.\n\nGod wasn’t merely creating Adam as an individual. He was initiating His purpose: to express Himself and represent His authority **through a corporate man**.\n\nAdam failed. But in Christ — the Second Man — God’s purpose resumes and will be fulfilled.\n\n---\n\n## The Church as the New Man\n\nIn **Colossians 3**, Paul tells us to “put on the new man.”  \nThis new man is **Christ expressed corporately** — in and through the church.\n\nThis is not just another way of describing the church — it is the **highest revelation** of what the church is. And it is also the **highest standard** of relationship among believers.\n\nLet’s compare:\n\n- The church as a **congregation** implies shared space or gathering.\n- The church as the **household of God** implies relational closeness — we’re family.\n- The church as the **Body of Christ** implies coordination, supply, and mutual functioning.\n- But the church as the **one new man**?  \n  It implies **one person**.\n\nOne mouth. One mind. One will. One expression.  \n**Not many individuals — but Christ, who is all and in all.**\n\nIn this new man, there is no room for our natural distinctions, identities, preferences, or positions.  \nThere is only Christ.\n\n---\n\n## Why This Matters\n\nThis vision is not just theological — it’s deeply practical.\n\nThe **one new man** doesn’t allow us to stay comfortable in our culture, personality, or background.  \nIt requires us to let go of everything not **in Christ** — because in this man, **Christ is all**.\n\nThis is why the one new man matters:\n- It reveals the **highest goal** of the church — not just to function, or relate, or gather, but to **be one person** in Christ.\n- It demands the **highest standard** of living — not just loving each other, but allowing Christ to live through all.\n- It shows us that God’s purpose is not simply to save individuals, but to create **a new humanity** that fulfills Genesis 1:26 — expressing God and representing Him on the earth.\n\nThis is the church God is after.  \nThis is the church the cross produced.  \nThis is the church we are called to put on.\n\n---\n\n## Final Word\n\nThe one new man is not just an ideal — it’s a creation.\n\nIt was created at the cross, raised in resurrection, and is now being renewed day by day — until Christ is expressed fully in His Body.\n\nLet us therefore put on this new man — not only as individuals growing in Christ, but as a people becoming **Christ together**."
  },
  {
    "slug": "rethinking-the-post-mortem",
    "title": "Rethinking the Post-Mortem",
    "description": "Let's take a look at post-mortems",
    "publishedAt": "2025-06-03",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Software Engineering"
        ]
      }
    ],
    "content": "\n# Rethinking the Post-Mortem\n\nWe had an incident recently.\n\nIt wasn't catastrophic. No alerts blazing through the night. No major outages. But it was enough to interrupt normal operations, and enough to ask, \"What went wrong here?\"\n\nLike most teams aiming for reliability, we followed up with a post-mortem.\n\nThe name always feels a bit dramatic to me. *Post-mortem.* It carries the tone of something final. Clinical. Like something died and now it's time to dissect it.\n\nBut that's not what we were doing.\n\nWe weren't examining a corpse. We were reviewing a system, *a living, evolving system*, that buckled under pressure. And more importantly, we were looking at **how we contributed to that pressure**.\n\n---\n\n## The Process Isn't Optional\n\nThe post-mortem process itself isn't comfortable. It requires slowing down. Rewinding. Confronting decisions we made with good intentions but bad assumptions. It means recognizing where process was missing, or where we chose to bypass it.\n\nBut this discomfort is necessary. Because if you're building anything complex, failure isn't optional. It's inevitable. The difference is whether you treat it as a setback or an opportunity.\n\nIn our case, it wasn't a single misstep. It was a chain of issues:  \n- Overconfidence in how far our current systems could stretch  \n- Underutilizing the expertise of our technical partners  \n- Gaps in handoffs and unclear ownership  \n\nThe system didn't fail us. *We failed to support the system.*\n\n---\n\n## Scaling Means Supporting the System\n\nAs I was reflecting on the incident, a line from *The Art of Scalability* stood out:\n\n> \"Scalable systems depend on scalable processes.\"\n\nIt's simple, but it's deeply true.\n\nYou can write solid code. Deploy it with confidence. Monitor it with the best tools. But if your team doesn't have the process to support growth, even a well-built system can break under its own weight.\n\nThat's what the post-mortem helps reveal. Not just what broke, but *why it was able to break in that particular way*.\n\nAnd once you start seeing it through that lens, the post-mortem stops being a reaction to failure, and starts becoming a tool for designing better systems.\n\n---\n\n## Not Looking Back, Looking Ahead\n\nSo maybe *post-mortem* isn't the right word for what this really is.\n\nWe didn't lose something. We learned something.\n\nWe identified pressure points. We surfaced blind spots. And we made changes to keep the next version of the system more resilient than the last.\n\nThat's not about blame. That's about **building forward**.\n\nAnd in any team serious about scale, that's the only direction worth going."
  },
  {
    "slug": "eating-in-1-corinthians",
    "title": "Eating in 1 Corinthians",
    "description": "Exploring the theme of eating in 1 Corinthians",
    "publishedAt": "2025-05-24",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Bible"
        ]
      }
    ],
    "content": "\n# Eating in 1 Corinthians: Why Our Spiritual Diet Matters\n\nIf you look closely at 1 Corinthians, a surprising theme starts to emerge: **eating**. Not just literal meals, but meals with deep spiritual meaning. Paul weaves this theme throughout the letter, often reaching back to the Exodus story to make his point.\n\nIt might feel unexpected at first. Why is something as ordinary as eating so central to the Christian life?\n\nBut the more you look into it, the clearer it becomes: in God's eyes, what we take in, spiritually speaking, plays a key role in who we become.\n\n## A Pattern from Exodus\n\nPaul doesn't pull these ideas out of thin air. He often references Israel's journey out of Egypt as a kind of spiritual blueprint. Just like the Israelites were saved from Egypt, passed through the sea, and then fed in the wilderness, we too are on a journey, and we're meant to be nourished along the way.\n\nIn 1 Corinthians 10:3–4, Paul writes:\n\n> \"They all ate the same spiritual food and drank the same spiritual drink. For they drank from the spiritual rock that followed them, and the rock was Christ.\"\n\nIt's not just a poetic metaphor. Paul's saying: **Christ was their sustenance**. And He's meant to be ours too.\n\n## Chapter 5: Beginning with the Passover\n\nIn chapter 5, Paul refers to Christ as our Passover:\n\n> \"Christ, our Passover lamb, has been sacrificed. Therefore, let us keep the feast...” (v.7–8)\n\nThis points back to the original Passover in Exodus. It wasn't just about blood on the doorposts; it was also about **eating the lamb**. That's how Israel was strengthened to leave Egypt.\n\nIn the same way, we don't just believe in Christ—we're invited to **take Him in**, to be nourished by Him. The Christian life starts with that kind of receiving.\n\n## Chapter 10: Food, Drink, and the Table\n\nChapter 10 takes the imagery further. First, Paul reminds the Corinthians that Israel was sustained in the wilderness by food and drink that symbolized Christ. Then, he brings the focus to the present:\n\n> \"The cup of blessing… is it not a participation in the blood of Christ? The bread that we break, is it not a participation in the body of Christ?\" (v.16)\n\nThis is where the spiritual eating becomes personal. The Lord's Table isn't just a tradition; it's a moment of real connection. A sharing. A partaking.\n\nWe're not just remembering Christ, we're participating in Him. Receiving His life. Being joined together in His body. It's a communal meal, but it's also deeply personal.\n\n## Chapter 14: A Kind of Spiritual Potluck\n\nBy the time we get to chapter 14, the language shifts, but the idea is still there. Paul describes a church gathering where \"each one\" brings something: a hymn, a teaching, a revelation.\n\nIt's not described in terms of food, but the dynamic is similar: **everyone contributes, and everyone is fed**. It's less about one person delivering content and more about the whole community sharing Christ with each other.\n\nThis, too, echoes the Old Testament feasts, times when God's people came together, bringing something of what they had received, and shared in joyful fellowship.\n\n---\n\n## Why It Matters\n\nIt's easy to think of the Christian life in terms of what we're supposed to do. But 1 Corinthians invites us to think in terms of **what (or who) we're taking in**.\n\nSpiritual growth isn't just about effort or discipline. It's about being nourished, regularly, deeply, and together with others. The more we feed on Christ, the more He becomes part of who we are.\n\nThat's how change happens. That's how the old patterns lose their grip. That's how God's purpose, to dwell in us and express Himself through us, becomes real.\n\n---\n\n## TL;DR\n\n- **Chapter 5** points to Christ as our Passover, the One we begin with by eating.\n- **Chapter 10** reminds us that Christ is our spiritual food and drink, and that the Lord's Table is a real participation in His life.\n- **Chapter 14** shows the church as a place where everyone brings something of Christ to share.\n\nIn all of this, eating is more than imagery, it's a way to describe how God works Himself into us, not through obligation but through nourishment.\n\n---\n\n## A Final Word\n\nThe question isn't just \"What should I be doing as a Christian?\" but \"What am I feeding on?\"\n\nAre we taking in Christ, in the Word, in prayer, in the Lord's table, and even through one another in community?\n\nBecause that's where transformation happens. Quietly, consistently, just like daily meals. It's not always dramatic, but it's always essential.\n\nWe become what we eat. And God's desire is that we would become people who don't just follow Christ, but people **filled with Him**."
  },
  {
    "slug": "christ-crucified-power-wisdom",
    "title": "Christ Crucified: The Power and Wisdom of God",
    "description": "What exactly does power and wisdom mean?",
    "publishedAt": "2025-05-17",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Bible"
        ]
      }
    ],
    "content": "\n# Christ Crucified: The Power and Wisdom of God\n\nIn 1 Corinthians 1:23–24, Paul makes a bold and surprising claim:\n\n> “We preach Christ crucified, to Jews a stumbling block and to Gentiles foolishness, but to those who are called, both Jews and Greeks, **Christ the power of God and the wisdom of God**.”\n\nLet that sink in. The cross—the very symbol of weakness, shame, and apparent defeat—is God’s ultimate display of **power** and **wisdom**.\n\nTo the religious mind, it’s offensive.  \nTo the intellectual mind, it’s foolish.  \nBut to those who have come to know Christ personally, it’s everything.\n\nWe don’t just admire the cross. We **live** by it.\n\n---\n\n## When Power Looks Like Weakness\n\nLet’s talk about **power**.\n\nWe often feel powerless. Powerless against a sinful habit we keep falling into. Powerless in a moment of conflict when our temper flares up again. Powerless when our mind is flooded with anxiety and we don’t know how to push through. Or maybe it's subtler—feeling helpless to love someone we just don’t click with, or to overcome our laziness when we know we should pray or serve.\n\nIn those moments, we instinctively try harder. We grit our teeth. We make vows. And often... we fail again.\n\nBut **Romans 6:6** tells us something radical:\n\n> “Our old man has been crucified with Him, in order that the body of sin might be annulled, that we should no longer serve sin as slaves.”\n\nThe cross isn’t just a historical event—it’s **our spiritual reality**. The part of us that keeps falling short—our old man—was dealt with at the cross. That means real power isn’t about trying harder. It’s about recognizing that **Christ already overcame**, and learning to live by the One who now lives in us.\n\nThat’s what **Galatians 2:20** means:\n\n> “I have been crucified with Christ; and it is no longer I who live, but Christ lives in me…”\n\nWe experience God's power when we stop relying on ourselves and begin depending on Christ in us. This doesn’t look dramatic. It may be as simple as stopping in the middle of an argument and inwardly saying, *“Lord, I can’t. But You can.”*\n\n---\n\n## When Wisdom Isn’t What We Expect\n\nNow let’s consider **wisdom**.\n\nWe usually think of wisdom as knowing the right answer, making the smart choice, or avoiding mistakes. But God’s wisdom is different—it’s not primarily about solving problems, but about **producing a person**.\n\nIn **1 Corinthians 1:30**, Paul writes:\n\n> “But of Him you are in Christ Jesus, who became to us wisdom from God: both **righteousness and sanctification and redemption**.”\n\nNotice—Christ doesn't just give us wisdom. He **is** our wisdom. And that wisdom unfolds as God's full salvation:\n\n- **Righteousness** in our spirit — when we were born again and justified.  \n- **Sanctification** in our soul — as we are transformed day by day.  \n- **Redemption** in our body — when we are glorified at Christ’s return.\n\nThis is wisdom not just for theology books—it’s wisdom for your Tuesday morning when you’re overwhelmed at work. It’s wisdom for your relationships, your parenting, your reactions. It’s wisdom for every time you think, *“I should know better,”* but realize you still fall short.\n\nWisdom, in God’s eyes, isn’t about perfection. It’s about **participation**—letting Christ live through us in the everyday.\n\n---\n\n## So What Does This Mean For Us?\n\nThe cross shows us a new way to live. Not by **self-effort**, but by **union**. Not by being clever or strong, but by being **dependent**.\n\nHere’s the irony: the cross looks like loss, but it’s gain. It feels like death, but it brings life.\n\nSo next time you feel defeated—by sin, by pressure, by weakness—remember: the answer isn’t to try harder. The answer is to turn inwardly to Christ. To let His death work in your self-life, and His life rise in you afresh.\n\nAnd when you’re confused, unsure of what to do or who to be—remember: Christ is your wisdom. He’s in you to walk you through every step, not always with explanations, but with presence.\n\n---\n\n## TL;DR\n\n**Christ crucified is not a past event to admire—it’s a present reality to live.**  \n- As **God’s power**, the cross delivers us from sin, self, and the world.  \n- As **God’s wisdom**, the cross brings us into Christ as our righteousness, sanctification, and redemption.  \n\nIt may look weak and foolish—but in God’s kingdom, **that’s the very path to life**."
  },
  {
    "slug": "art-of-scalability-clarity-capacity",
    "title": "The Art of Scalability: Clarity and Capacity",
    "description": "How understanding ownership and resources can transform team execution",
    "publishedAt": "2025-05-13",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": "Leadership"
      }
    ],
    "content": "\n# The Art of Scalability: Clarity and Capacity\n\nEver been on a team where no one's quite sure who owns what? Where two people do the same thing—or worse, no one does it?\n\nYeah, me too.\n\nLast week I started reading *The Art of Scalability* by Abbott and Fisher, and Chapter 2 put words to that mess.\n\nIt's not always a people problem—it's often a structure problem.\nSpecifically: a lack of clarity and capacity.\n\n## The Two Key Ingredients\n\n**Clarity** = knowing what you're responsible for (and what you're not)  \n**Capacity** = having enough people in the right places to deliver\n\nWithout those two things, teams can't execute. They just improvise.\n\nSometimes it works. Often, it doesn't.\n\n## The Impact\n\nThat hit me. Because I've seen the fallout of missing clarity and capacity—not in big orgs, but in small teams, even side projects.\n\nThings slip. Stress creeps in. No one's slacking—it's just hard to move when the ground's uncertain.\n\n## The Transformation\n\nWhen teams get clarity and capacity right, something magical happens.\n\nThings move. People step up. Execution sharpens.\n\nYou can feel the difference—and it makes you want to build even more.\n\n## Understanding Clarity\n\nClarity isn't just about job titles or org charts. It's about:\n\n1. **Ownership**: Who's the final decision maker? Who's accountable?\n2. **Boundaries**: What's in scope? What's out of scope?\n3. **Dependencies**: Who needs what from whom?\n4. **Success Metrics**: How do we know we're winning?\n\nI've seen teams where everyone's trying to be helpful, but no one's quite sure who should make the call. The result? Decision paralysis or, worse, conflicting decisions.\n\n### A Common Scenario\n\nPicture this: Three engineers are working on the same feature, each with their own approach. Sounds collaborative, right? But it leads to:\n\n- Duplicate work\n- Inconsistent implementations\n- Wasted time in meetings to align\n- Frustration when changes conflict\n\nThe fix isn't complex. The team:\n1. Assigns a clear owner\n2. Defines the boundaries\n3. Sets up regular sync points\n4. Establishes clear success criteria\n\nSuddenly, the same team is moving faster, with less stress.\n\n## Building Capacity\n\nCapacity isn't just about headcount. It's about:\n\n1. **Skills**: Do we have the right expertise?\n2. **Time**: Do people have space to do their best work?\n3. **Tools**: Are we giving teams what they need?\n4. **Support**: Is there help when things get tough?\n\n### The Capacity Trap\n\nMany leaders fall into this trap: thinking more people = more capacity. But that's not always true. Sometimes it's about:\n\n- Removing bottlenecks\n- Automating repetitive tasks\n- Providing better tools\n- Creating space for deep work\n\n## Putting It Together\n\nThe magic happens when clarity and capacity work together:\n\n1. **Clear Ownership + Right Skills**: People know what to do and can do it well\n2. **Defined Boundaries + Proper Tools**: Teams can move fast without stepping on toes\n3. **Clear Metrics + Adequate Time**: Success is measurable and achievable\n\n## Practical Steps\n\nIf you're feeling the pain of unclear ownership or stretched capacity, try these steps:\n\n1. **Map Your Current State**\n   - List all major responsibilities\n   - Note who's doing what\n   - Identify gaps and overlaps\n\n2. **Define Clear Ownership**\n   - Assign single owners for each area\n   - Document responsibilities\n   - Set up regular review points\n\n3. **Assess Capacity**\n   - Look at current workload\n   - Identify bottlenecks\n   - Plan for growth\n\n4. **Create Feedback Loops**\n   - Regular check-ins\n   - Clear escalation paths\n   - Open communication channels\n\n## The Payoff\n\nWhen you get clarity and capacity right, you'll see:\n\n- Faster decision-making\n- Higher team morale\n- Better quality output\n- More innovation\n- Sustainable growth\n\nIt's not about creating bureaucracy. It's about creating the space and structure for teams to do their best work.\n\n## Moving Forward\n\nAs teams continue to scale, keeping these principles front and center becomes crucial. It's not always easy—sometimes it means having tough conversations about ownership or making hard decisions about resources.\n\nBut when you see a team that's clear on their mission and has the capacity to execute, it's worth every bit of effort.\n\nBecause that's when the real magic happens."
  },
  {
    "slug": "romans-8-law-of-the-spirit",
    "title": "The Law That Liberates: Living by the Spirit in Romans 8",
    "description": "Diving into the law of the Spirit of life",
    "publishedAt": "2025-05-09",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Bible"
        ]
      }
    ],
    "content": "\n# The Law That Liberates: Living by the Spirit in Romans 8\n\nRomans 8:2 unveils a profound spiritual principle:  \n> \"For the law of the Spirit of life in Christ Jesus has set you free from the law of sin and of death.\"\n\nPaul is not referring to commandments or a moral code. This \"law\" is a **living principle**, an automatic dynamic—like the law of gravity—that operates **spontaneously** in those who are in Christ. It's not something we work to uphold, but something that works **in us**, when we remain in fellowship with Him.\n\n## A Law That Frees\n\nWhat’s revolutionary is what this law does:  \nIt **sets us free**.\n\nIt frees us not only from **sin’s power**, but from the **self-effort** to escape it. We are liberated from the exhausting cycle of failure—not by trying harder, but by being **connected to the Spirit of life**.  \nThis is the secret to the Christian experience:  \n> **Freedom is not achieved by striving, but by abiding.**\n\nThe One who declared “the year of the Lord’s favor” (Luke 4:19)—the year of jubilee—has become **the Spirit** (2 Cor. 3:17). And where the Spirit is, **there is freedom**.\n\nThus, the \"law of the Spirit of life\" is God’s way of releasing us—not by external control, but by internal vitality. As we enjoy and turn to the Lord, this law spontaneously overcomes the law of sin and death within us.\n\n## The Key Is Dependence\n\nBut what does this look like practically?  \nRomans 8 gives us a picture—not of striving, but of **depending**.\n\nIn my early Christian years, I often heard words like *obedience*, *submission*, and *surrender*. These are good and biblical terms, but sometimes they left me focused on my own will and effort.\n\nRomans 8 offers something more organic: **dependence**.\n\n> Romans 8:4 speaks of “walking according to the Spirit.”  \n> The phrase “according to” can also mean “in line with” or “alongside”—like a cane.\n\nA man doesn’t obey his cane. He doesn’t submit to it.  \nHe **depends** on it to take his next step.\n\nTo walk according to the Spirit is to live **in step** with the Spirit—leaning on Him moment by moment, like a man walking with a cane.\n\n## Minding the Spirit\n\nRomans 8:5 says we are to **“mind the things of the Spirit.”**  \nThis isn’t about rules—it’s about **relationship**.\n\nFor example, in a healthy marriage, a wife may care not just about what her husband says explicitly, but **how he feels about something**—even if it’s unspoken. Say she’s choosing an outfit for a formal event. She may recall her husband’s quiet delight over a certain color—not because he instructed her, but **because she’s attuned to his feelings**. This isn’t mere submission; it’s fellowship, affection, and consideration.\n\nIn the same way, to “mind the things of the Spirit” (Romans 8:5) is not about law-keeping—it’s about living in step with the Lord’s heart, responding not just to His commands, but **to His inner feeling.**\n\nThis isn’t cold obedience—it’s a warm, living fellowship.\n\n## Sons Who Cry\n\nThe climax of Romans 8 is found in verse 15:\n\n> *“You have received the Spirit of sonship, by whom we cry, ‘Abba, Father!’”*\n\nThis is the most personal expression of our life in Christ:  \n**Dependence that turns into a cry.**\n\nMy children express their sonship not only by obeying me or representing me, but by **needing me**. When they cry, “Daddy,” they show they know who I am to them.\n\nOur life in Christ is the same.\n\nThe truest mark of sonship is not how well we perform—but how deeply we **depend**.  \nAnd out of that dependence comes the cry:  \n**“Abba, Father.”**\n\n---\n\n## TL;DR\n\n- Romans 8:2 speaks of a **living, liberating law**—the law of the Spirit of life.\n- This law frees us not only from **sin**, but from the **struggle** to escape sin through our own effort.\n- Freedom comes by **abiding**, not striving—by depending on the Spirit in our daily walk.\n- To walk “according to the Spirit” is like **leaning on a cane**—constant, moment-by-moment reliance.\n- Minding the Spirit means **caring for the Lord’s heart**, not just His commands.\n- Our highest expression as sons is not obedience alone, but the **cry of dependence**:  \n  > “Abba, Father.”\n\nThis is the reality of the Christian life:  \n**A life of freedom, formed by dependence, and filled with the Spirit.**"
  },
  {
    "slug": "simple-leadership-principle-software-engineering",
    "title": "Simple: A Leadership Principle in Software Engineering",
    "description": "Some reflections on Extreme Ownership",
    "publishedAt": "2025-05-06",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": "Leadership"
      }
    ],
    "content": "\nI've been on paternity leave recently, and between newborn naps and toddler playtime, I've finally had a little more space to read. I'm working through Extreme Ownership as part of a book club at BuildWitt and one principle in particular has stuck with me: \"Simple.\"\n\nJocko Willink explains that if a plan or message isn't simple, it won't be understood, and if it's not understood, it won't be executed, especially under pressure.\n\nThat makes perfect sense in high-stakes environments like the military. But it also made me wonder: How does this apply to software? Because let's face it, software gets complex fast, especially as teams grow and systems scale.\n\nHere's where I landed:\n\nSimple doesn't mean simplistic. In engineering, \"simple\" often means clear. Clear boundaries between services. Clear naming. Clear documentation. Clear expectations between teammates.\n\nYes, some complexity is necessary. But before introducing it, I've found it helpful to ask:\n\n- What problem is this really solving?\n- Will this be obvious to someone joining the team six months from now?\n- Can this be explained in a few sentences without whiteboarding the whole system?\n- Are we adding flexibility for a real use case, or just in case?\n\nAnd when complexity is justified, I've learned that simplicity still matters, especially in how we communicate it. Whether it's a good diagram, a well-structured doc, or a thoughtful conversation, simplicity shows up in how we lead.\n\nIt's a good reminder: clarity isn't just a design goal, it's a leadership habit.\n"
  },
  {
    "slug": "seed-of-david-son-of-god-romans",
    "title": "The Seed of David Becoming the Son of God",
    "description": "An exploration in to Romans 1:3-4",
    "publishedAt": "2025-05-04",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Bible"
        ]
      }
    ],
    "content": "\n# The Seed of David Becoming the Son of God\n\nIn Romans 1:3–4, Paul introduces Jesus Christ with two profound titles:  \nHe is the **Seed of David according to the flesh**, and the **Son of God in power according to the Spirit of holiness out of the resurrection of the dead**.\n\nThis introduction reveals Christ's **two natures**:\n\n- As the **Seed of David**, He is a genuine man—born of a woman, descended from David, possessing the human nature God created in Adam. This nature was **untainted by sin**.\n- As the **Son of God**, He is divine—eternally begotten of the Father, possessing God's life and nature.\n\nYet what is striking is Paul's choice of the word **\"designated\"** (or \"marked out\"):  \nHe writes that this Jesus, who came from David's line, was **designated Son of God in power… out of the resurrection of the dead**.\n\nWait—wasn't Jesus always the Son of God?\n\nYes. According to John 3:16, He is the **only begotten Son**, given to the world. He was God’s Son **before** the resurrection. But Paul is not speaking of His **eternal status**, but rather of something that happened **through resurrection**.\n\nTo understand this, we need to read **Acts 13:33**, where Paul applies **Psalm 2** to Jesus’ resurrection:\n\n> “You are My Son; today I have begotten You.”\n\nPaul interprets the **“today”** as the day of **resurrection**.  \nIn other words, Jesus’ resurrection was a kind of **begetting**—a public designation, even an *uplifting*, of His humanity.\n\nThough His humanity was sinless and perfect, it was not yet **glorified**. Through death and resurrection, God uplifted that humanity—uniting it fully with divinity in glory. This is why Paul says He was *designated Son of God in power*. What God had sought in Adam, He finally gained in Christ—God and man joined **not just in person**, but in **process and result**.\n\nThis is confirmed in **Hebrews 2:10** and **6:20**—Jesus is now the **Forerunner**, leading **many sons into glory**. This is not just leadership by authority, but by **pattern** and **participation**.\n\nIn **Romans 8:29**, Paul calls Him the **Firstborn among many brothers**.  \nHe is no longer the only begotten—He’s the **Firstborn**.  \nThat implies there are others.\n\nWho are they?\n\nAccording to **1 Peter 1:3**, *“God… has regenerated us… through the resurrection of Jesus Christ.”*\n\nHis resurrection was both His **designation** and our **regeneration**.\n\nNow, we too are on the same path. We are being **conformed to His image** (Rom. 8:29).  \nThis is the essence of the Christian life: not just to believe in Christ, but to **become like Christ**.\n\nSo when we pray, when we worship, when we serve—we are not just performing Christian activity.  \nWe are participating in a process:  \nWe are being conformed to the One who was designated Son of God in power.\n\n---\n\n## TL;DR\n\n- Jesus Christ is both **the Seed of David** (a genuine man) and **the Son of God** (divine).\n- Though always the Son, He was **designated Son of God in power** through **resurrection**—His perfect humanity was uplifted and glorified.\n- That resurrection was also **our regeneration** (1 Peter 1:3).\n- Now He is the **Firstborn among many brothers** (Rom. 8:29)—and we are being **conformed to His image**.\n- The Christian life is not just about doing things for God; it’s about being **transformed into the image of the resurrected, designated Son of God**.\n- This gives meaning to everything we do as believers.\n\n[Back to Home](/) "
  },
  {
    "slug": "correlating-hangfire-jobs-http-requests-datadog",
    "title": "Correlating Hangfire Background Jobs with HTTP Requests Using Datadog and .NET",
    "description": "Let's look at how to correlate hangfire jobs with http requests using datadog",
    "publishedAt": "2025-03-04",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Software Engineering"
        ]
      }
    ],
    "content": "\n# Correlating Hangfire Background Jobs with HTTP Requests Using Datadog and .NET\n\nDistributed tracing can feel like magic — until it doesn't work.\n\nRecently, while integrating observability into a .NET web app using **Datadog**, I hit a wall. I had traces from HTTP requests. I had logs. I had background jobs running through **Hangfire**. But there was one crucial gap:\n\n> **Traces from my background jobs weren't correlated with the original HTTP requests.**\n\nHere's how I fixed it, and more importantly — **what I learned about tracing and observability along the way**.\n\n---\n\n## 🤯 The Problem: Disconnected Traces\n\nIn a typical setup:\n\n- An HTTP request comes in.\n- You queue a background job to do some work (via Hangfire).\n- That job executes *later*, often on a different thread or even a different machine.\n\nIf you're using **Datadog APM**, the default behavior is:\n\n- The HTTP request gets a trace.\n- The background job gets a *separate trace*.\n- You, the human, get lost trying to connect the dots.\n\nThat's because **traces don't magically carry over**. Unless you explicitly pass trace context, each job runs in its own isolated observability bubble.\n\n---\n\n## 🧠 A Quick Primer on Traces, Spans, and Context\n\nIf you're new to distributed tracing, here's what you need to know:\n\n- A **trace** represents the full journey of a request through a system.\n- A **span** is a single unit of work (e.g., an HTTP handler, a DB call, or a background job).\n- Every span has:\n  - A `trace_id` (identifying the whole trace)\n  - A `span_id` (identifying the specific work)\n  - A `parent_span_id` (the span that called it)\n\nTo connect your background job to the original HTTP request, you need to:\n\n1. **Capture the trace and span info when queuing the job**\n2. **Rehydrate that context when the job executes**\n3. **Start a new span as a child of the original span**\n\n---\n\n## 🛠 The Solution in .NET with Hangfire and Datadog\n\n### Step 1: Capture the Trace Context\n\nWhen queuing a background job, we extract the current trace context using `Datadog.Trace` and save it to Hangfire's Job Parameters:\n\n```csharp\npublic string Enqueue(BackgroundJob job) : IBackgroundJobQueuer\n{\n    var jobId = _backgroundJobClient.Enqueue(p => p.Process(job));\n\n    var scope = Tracer.Instance.ActiveScope;\n    if (scope != null)\n    {\n        var traceId = scope.Span.TraceId.ToString();\n        var spanId = scope.Span.SpanId.ToString();\n\n        using var connection = JobStorage.Current.GetConnection();\n        connection.SetJobParameter(jobId, \"TraceId\", traceId);\n        connection.SetJobParameter(jobId, \"ParentSpanId\", spanId);\n    }\n\n    return jobId;\n}\n```\n\n---\n\n### Step 2: Create a Hangfire Filter to Restore the Context\n\nBefore the background job runs, we use a `IServerFilter` to start a new span linked to the original trace:\n\n```csharp\npublic sealed class DatadogTracingFilter : IServerFilter\n{\n    private const string ScopeKey = \"DatadogScope\";\n\n    public void OnPerforming(PerformingContext context)\n    {\n        var traceIdStr = context.Connection.GetJobParameter(context.BackgroundJob.Id, \"TraceId\");\n        var parentSpanIdStr = context.Connection.GetJobParameter(context.BackgroundJob.Id, \"ParentSpanId\");\n\n        if (ulong.TryParse(traceIdStr, out var traceId) &&\n            ulong.TryParse(parentSpanIdStr, out var parentSpanId))\n        {\n            var tracer = Tracer.Instance;\n\n            var settings = new SpanCreationSettings\n            {\n                Parent = new SpanContext(traceId, parentSpanId)\n            };\n\n            var scope = tracer.StartActive(\"background.job\", settings);\n            scope.Span.ResourceName = context.BackgroundJob.Job.Type.Name;\n            scope.Span.SetTag(\"hangfire.job_id\", context.BackgroundJob.Id);\n            scope.Span.SetTag(\"background.job_type\", context.BackgroundJob.Job.Type.FullName);\n            scope.Span.SetTag(\"dd.trace_id\", traceIdStr);\n\n            context.Items[ScopeKey] = scope;\n        }\n    }\n\n    public void OnPerformed(PerformedContext context)\n    {\n        if (context.Items.TryGetValue(ScopeKey, out var scopeObj) && scopeObj is Scope scope)\n        {\n            scope.Dispose();\n        }\n    }\n}\n```\n\n---\n\n### Step 3: Register the Filter\n\nMake sure this filter is registered globally in your Hangfire setup:\n\n```csharp\nGlobalJobFilters.Filters.Add(new DatadogTracingFilter());\n```\n\n---\n\n## 🧭 What I Learned (That Applies Beyond .NET)\n\n### 1. Observability is Not Automatic\n\nJust because you're using an APM tool doesn't mean your observability is complete. You still need to be intentional about **propagating context across boundaries** like queues, jobs, and microservices.\n\n### 2. Traces and Logs Are Not the Same\n\nYou might be logging a `trace_id`, but unless that ID is part of a real, active trace context — **your traces won't be linked**.\n\n### 3. Spans Must Be Linked Explicitly\n\nCreating a new span doesn't mean it's part of an existing trace. To link spans, you must **pass the parent context** — either via headers (in web requests), or job metadata (like we did).\n\n### 4. Tags Help Humans, Context Helps Systems\n\nSetting `dd.trace_id` as a tag is helpful for searching, but it's not enough to link spans. **Tags are for you; context is for the APM**.\n\n---\n\n## 📦 Bonus: Why Not OpenTelemetry?\n\nYes, OpenTelemetry could help standardize this, and Datadog supports OTLP ingestion. But:\n\n- OpenTelemetry is still evolving in .NET\n- Datadog's native SDK offers powerful control\n- This solution works now — and plays well with Datadog's UI\n\nThat said, the principles here still apply if you're using OTEL — it just changes **how** you carry and restore context.\n\n---\n\n## 🔚 Final Thoughts\n\nGetting this working took some deep dives — not just into code, but into how distributed tracing *really works*. But now, when I look at a trace in Datadog and see an HTTP request linked cleanly to a background job, it feels worth it.\n\n> Observability isn't just about capturing data — it's about **connecting it**.\n\n---\n\n👋 Have questions or want to see how this fits into your stack? Reach out or leave a comment!\n\n[Back to Home](/) "
  },
  {
    "slug": "microservices-manageable-dotnet-aspire",
    "title": "Making Microservices Manageable with .NET Aspire, Git Submodules, and OpenTelemetry",
    "description": "Let's look at .NET Aspire as a potential solution to microservices development",
    "publishedAt": "2025-02-05",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": [
          "Software Engineering"
        ]
      }
    ],
    "content": "\n# Making Microservices Manageable with .NET Aspire, Git Submodules, and OpenTelemetry\n\nMicroservices give us flexibility. They also give us a headache.\n\nAt their best, microservices enable independent deployment, scalability, and team autonomy. But too often, they introduce local development chaos, debugging nightmares, and operational overhead—especially when we're just trying to deliver cohesive **products**, not architecture for architecture's sake.\n\nThis post explores how we can tame microservices using [.NET Aspire](https://devblogs.microsoft.com/dotnet/introducing-dotnet-aspire/), Git submodules, and local OpenTelemetry tracing. We'll walk through practical strategies to create a **monorepo-like developer experience**—even when you don't have a monorepo.\n\n---\n\n## 👎 The Reality of Microservices in Practice\n\nWhile microservices are great for deployment and scalability, they tend to:\n\n- **Break local dev workflows**: You need to spin up multiple services manually, in the right order, with the right env variables and ports.\n- **Make debugging painful**: Tracing a request across multiple services becomes a guessing game.\n- **Fragment ownership**: Services owned by different teams may live in different repos, on different deployment pipelines, and with different assumptions.\n- **Slow onboarding**: New developers often spend more time setting up services than writing code.\n\nThese are real tradeoffs—and often overlooked when teams jump on the \"microservices\" bandwagon.\n\n---\n\n## ✅ But We're Building Products\n\nDespite the architectural breakdown of services, what we're actually delivering is a **product**. That means we care more about how all the pieces fit together than the internals of each individual service.\n\nWhen you're building a product:\n\n- **Local cohesion matters.**\n- **Cross-service observability matters.**\n- **Running everything quickly and predictably matters.**\n\nThis is where `.NET Aspire` comes in.\n\n---\n\n## 🚀 .NET Aspire to the Rescue\n\n`.NET Aspire` is a new stack from Microsoft designed to make building distributed apps easier. It gives you a structured way to define, compose, and run a multi-service application locally.\n\nAspire supports things like:\n\n- Declarative service definitions\n- Local dev orchestration (like Docker Compose, but smarter and .NET-native)\n- Native integration with OpenTelemetry\n- IDE tooling and launch profiles out of the box\n\nLet's look at an example:\n\n```csharp\nvar builder = DistributedApplication.CreateBuilder(args);\n\nvar service1 = builder.AddProject(\"service1\", \"../services/service1/Service1.API.csproj\")\n    .WithHttpsEndpoint(port: 7001, name: \"api\");\n\nvar service2 = builder.AddProject(\"service2\", \"../services/service2/Service2.API.csproj\")\n    .WithReference(service1)\n    .WithEnvironment(\"Service1__Uri\", service1.GetEndpoint(\"api\"));\n\nvar frontend = builder.AddYarnApp(\"frontend\", \"../services/frontend\", \"dev\")\n    .WithReference(service1)\n    .WithReference(service2)\n    .WithEnvironment(\"VITE_SERVICE1_URL\", service1.GetEndpoint(\"api\"))\n    .WithEnvironment(\"PORT\", \"5174\")\n    .WithHttpsEndpoint(targetPort: 5174, port: 5173, name: \"client\");\n\nbuilder.Build().Run();\n```\n\nThis Aspire `Program.cs` script declares how your product is composed. It specifies startup order, environment variables, references, ports, and more—all in one place.\n\n---\n\n## 🔗 Git Submodules: Repo Independence, Dev Cohesion\n\nWhat if your services live in separate repositories?\n\nThat's where Git submodules help. You can add each service as a submodule to your Aspire app repository:\n\n```bash\ngit submodule add https://example.com/service1 services/service1\ngit submodule add https://example.com/service2 services/service2\ngit submodule add https://example.com/frontend services/frontend\n```\n\nThis allows:\n\n- Teams to retain ownership and versioning of individual services\n- The Aspire app to pull them in for local dev and orchestration\n- Isolation of concerns with a single command to clone everything:\n\n```bash\ngit clone --recurse-submodules https://example.com/aspire-app\n```\n\n> ✅ Bonus: In your `.gitmodules`, specify `branch = main` if your submodules don't default to it.\n\n---\n\n## 🔍 Distributed Tracing: Don't Debug in the Dark\n\nLocal dev is one thing. But once multiple services are talking to each other, tracing becomes essential. Aspire supports OpenTelemetry (OTel) out of the box.\n\nYou can even add your own tracing collector:\n\n```csharp\nbuilder.AddOpenTelemetryCollector(\"otel\")\n    .WithHttpEndpoint(port: 4318);\n```\n\nAnd then configure your services and frontends to send traces to `http://localhost:4318`.\n\nFor a React/Vite frontend in dev mode:\n\n```env\n# .env file\nVITE_OTEL_EXPORTER_OTLP_ENDPOINT=http://localhost:4318\n```\n\nThen, in your code:\n\n```ts\nimport { WebTracerProvider } from '@opentelemetry/sdk-trace-web';\n\nif (import.meta.env.MODE === 'development') {\n  const provider = new WebTracerProvider();\n  // Configure exporter + tracing logic\n}\n```\n\nNow, whether it's a `.NET API` or a `React app`, you can follow a trace from click to DB and back—all locally.\n\n---\n\n## 🧠 Big Takeaways\n\n1. **You don't need a monorepo to get a monorepo-like experience.**\n   - Use `.NET Aspire` + Git submodules to orchestrate services locally.\n\n2. **Deliver products, not services.**\n   - Think about the full product experience, from frontend to DB, not just isolated deployables.\n\n3. **Use distributed tracing—even in dev.**\n   - Set up local OpenTelemetry to debug and diagnose with confidence.\n\n4. **Simplify local development.**\n   - Aspire helps you run your product with one command, instead of 5 terminals and a README.\n\n---\n\n## 🧪 Final Thoughts\n\nMicroservices are here to stay—but the way we develop with them has to evolve. `.NET Aspire`, Git submodules, and OpenTelemetry can bridge the gap between independent services and cohesive product delivery.\n\nIf you're drowning in `docker-compose.yml` files or juggling 6 terminal windows every time you onboard a new dev, give Aspire a look. You might just enjoy building distributed systems again.\n\n\n[Back to Home](/) "
  },
  {
    "slug": "key-habits-effective-leader-covey",
    "title": "Key Habits of a Leader",
    "description": "Some reflections on The 7 Habits of Highly Effective People by Stephen Covey",
    "publishedAt": "2025-01-31",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": "Leadership"
      }
    ],
    "content": "\n# Some Key Habits of a Leader\n\nI recently finished reading The 7 Habits of Highly Effective People by Stephen Covey, and it was eye-opening! These habits aren't just theories—they're practical principles that have reshaped how I approach both work and life.\n\nA few habits that really hit home for me:\n\n## Win/Win\n\nThink Win/Win: As someone working with products, I've seen firsthand how prioritizing mutual success builds stronger relationships. When you aim for outcomes that benefit both customers and stakeholders, you create partnerships that last.\n\n## First Understand, Then Be Understood\n\nSeek First to Understand, Then to Be Understood: This one really changed how I handle conversations—especially tough ones. Listening with empathy has helped me uncover customer needs I might have missed and find clarity in complex team discussions.\n\n## Synergize\n\nSynergize: Collaboration isn't just a buzzword—it's a game changer. Some of the best solutions I've been part of didn't come from me or any one person. They came from combining diverse perspectives across teams. It's amazing what happens when you embrace creativity and trust in others' expertise.\n\n## Sharpen the Saw\n\nSharpen the Saw: Covey talks about renewal, and this resonated deeply. I've realized how critical it is to invest in personal growth—whether it's through learning, rest, or even stepping back to reflect. Growth isn't a sprint; it's a marathon.\n\n\n## Trust\nFor me, the biggest shift was embracing Covey's concept of the \"emotional bank account.\" Every interaction—whether with customers, peers, or family—is a deposit or a withdrawal. Building trust, showing kindness, and keeping commitments aren't just nice ideas; they're the foundation of meaningful relationships.\n\nThese habits offer fresh remainders that tech is more than software—it's about people. When we lead with empathy and collaboration, we don't just deliver value; we create impact that lasts.\n\nWhat habits or principles have shaped how you work and lead?\n\n[Back to Home](/) "
  },
  {
    "slug": "equifax",
    "title": "What I learned from Equifax",
    "description": "",
    "publishedAt": "2024-12-01",
    "author": {
      "name": "Carlos Salamanca"
    },
    "categories": [
      {
        "name": "Leadership"
      }
    ],
    "content": "\n# What I learned from Equifax\n\nThe Equifax data breach of 2017 was more than just a cybersecurity failure. It was an organizational one. Sensitive information from 147 million people was exposed, but what compounded the damage was how the company handled it. The breach started in May, but it took months for leadership, including the CEO, to even learn of the problem. By the time the public was informed, trust had been obliterated. This happened not just because of the breach itself, but also because of the delayed and opaque response.\n\nHere’s the hard truth: organizational failures of this magnitude rarely start with technical flaws. They stem from cultural gaps, such as gaps in transparency, accountability, and ownership.\n\nSo what lessons can we learn from Equifax?\n\n## 1. Transparency Must Start at the Top\n\nTransparency isn’t just about being upfront with customers. It’s about building a culture where bad news travels fast and effectively within the organization. Leaders must create an environment where teams feel empowered, and obligated, to escalate issues without fear of blame.\n\n## 2. Ownership is Organizational\n\nSecurity, like success, is everyone’s responsibility. A culture of ownership starts at the top and filters down. Leaders need to set the example, treating risks and vulnerabilities as shared challenges, not isolated team problems.\n\n## 3. Build Systems that Support Culture\n\nEven the best intentions mean little without processes to back them up. Organizations must invest in tools and workflows that enable rapid escalation, clear communication, and swift decision-making. Leadership cannot act on what they don’t know.\n\nThink about this: If a breach happened today, how long would it take for your organization’s leadership to learn about it? Would your teams have the trust and infrastructure to respond decisively? Would your customers hear the truth before rumors spread?\n\nThe Equifax breach reminds us that technical safeguards are only part of the equation. The bigger question is whether your organization has the cultural and structural readiness to face challenges head-on, with transparency and ownership leading the charge.\n\nWhen challenges arise, does your organization’s culture enable a quick, honest response? Or does it risk letting small issues snowball into crises?\n\n[Back to Home](/) "
  }
]